## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_iam_policy.trivy_db_download`                                    |
|        | `aws_iam_role_policy_attachment.trivy_db_download`                    |
|        | `module.github_workflow_roles.aws_iam_role.this[&quot;trivy-db-download&quot;]` |
| delete | `aws_ecrpublic_repository_policy.generate_sbom_trivy_db`              |
|        | `aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecrpublic_repository_policy.generate_sbom_trivy_db will be destroyed
  # (because aws_ecrpublic_repository_policy.generate_sbom_trivy_db is not in configuration)
  - resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_db" {
      - id              = "security-tools/generate_sbom/trivy-db" -> null
      - policy          = (sensitive) -> null
      - registry_id     = "794722365809" -> null
      - repository_name = "security-tools/generate_sbom/trivy-db" -> null
    }

  # aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db will be destroyed
  # (because aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db is not in configuration)
  - resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_java_db" {
      - id              = "security-tools/generate_sbom/trivy-java-db" -> null
      - policy          = (sensitive) -> null
      - registry_id     = "794722365809" -> null
      - repository_name = "security-tools/generate_sbom/trivy-java-db" -> null
    }

  # aws_iam_policy.trivy_db_download will be created
  + resource "aws_iam_policy" "trivy_db_download" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "trivy-db-download"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:GetServiceBearerToken",
                          + "ecr-public:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECRPublicAuth"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.trivy_db_download will be created
  + resource "aws_iam_role_policy_attachment" "trivy_db_download" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "trivy-db-download"
    }

  # module.github_workflow_roles.aws_iam_role.this["trivy-db-download"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/*:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::794722365809:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trivy-db-download"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.trivy_db_download"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
